var app = app || {};

(function () {

    "use strict";

    var conf = {};

    conf.FEE = {
	"month": [
	    ["入会金", "￥6,000", "￥6,000"," ￥6,000", "￥6,000"],
	    ["一般会員", "￥5,000", "￥6,500", "￥6,500", "￥7,500"],
	    ["家族会員(二人目)", "￥4,000", "￥5,500", "￥5,500", "￥6,500"],
	    ["家族会員(三人目)", "￥3,000", "￥4,500", "￥4,500", "￥5,500"],
	    ["サークル会員", "￥5,000", "￥6,000", "￥6,000", "￥7,000"]
	],
	"half": [
	    ["入会金", "￥6,000", "￥6,000"," ￥6,000", "￥6,000"],
	    ["一般会員", "￥25,000", "￥32,500", "￥32,500", "￥37,500"],
	    ["家族会員(二人目)", "￥20,000", "￥27,500", "￥27,500", "￥32,500"],
	    ["家族会員(三人目)", "￥15,000", "￥22,500", "￥22,500", "￥27,500"],
	    ["サークル会員", "-", "-", "-", "-"]
	],
	"year": [
	    ["入会金", "￥6,000", "￥6,000"," ￥6,000", "￥6,000"],
	    ["一般会員", "￥50,000", "￥65,000", "￥65,000", "￥75,000"],
	    ["家族会員(二人目)", "￥40,000", "￥55,000", "￥55,000", "￥65,000"],
	    ["家族会員(三人目)", "￥30,000", "￥45,000", "￥45,000", "￥55,000"],
	    ["サークル会員", "-", "-", "-", "-"]
	],
    };

    conf.LINKS = [
	["日本国際テコンドー協会", "http://www.taekwon-do.co.jp/"],
	["朴道場", "http://www.taekwon-do-pakdojo.com"],
	["黄道場", "http://tkd-hwangdojo.jp/"],
	["高知道場", "http://www.kig-laboratory.com/"],
	["町屋道場", "http://famiteko.k-server.org/"],
	["渋谷道場", "http://www.tkd-hs.jp/sasazuka/"],
	["府中道場", "http://www.fuchudojo.sakura.ne.jp/"],
	["函館道場", "http://itfhakodate.web.fc2.com/"],
	["札幌道場", "http://www5f.biglobe.ne.jp/~itf-sapporoclub/"],
	["千葉道場", "http://www.seodojang.com/"],
	["京都道場", "http://www.itf-chodojo.jp/"],
	["宮崎道場", "http://www.miyazaki-catv.ne.jp/~itf-hiro/"],
	["オムスクール", "http://www.omschool.jp/"]
    ];
    // export
    app.conf = conf;
    
})();
